# MEPSize Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSize Class
Members See Also
---
Stores the basic size information for an MEP duct, pipe, cable tray, or conduit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class MEPSize : IDisposable
```

Visual Basic
---
```text
Public Class MEPSize _
	Implements IDisposable
```

Visual C++
---
```text
public ref class MEPSize : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..MEPSize
# See Also
MEPSize Members
Autodesk.Revit.DB Namespace